WrStat/wrstat-summary.tex
% Created 2024-01-19 Fri 11:16
% Intended LaTeX compiler: xelatex
\documentclass[10pt,twoside,landscape]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{subcaption}
\usepackage[newfloat]{minted}
\usepackage{color}
\usepackage{listings}
\usepackage[top=2cm,bottom=2cm,right=2cm,left=2cm,landscape]{geometry}
\usepackage{multicol}
\usepackage{enumitem}
\usepackage{fancyhdr}
\usepackage{caption}
\usepackage{algorithm}
\usepackage{algpseudocode}
\usepackage{float}
\setlist[description]{itemsep=-1pt,leftmargin=2mm,topsep=0pt}
\setlist[itemize]{itemsep=-1pt,topsep=0pt}
\setlist{noitemsep}
\setlength{\parindent}{0pt}
\setlength{\columnseprule}{0.2pt}
\definecolor{mygreen}{rgb}{0,0.6,0}
\definecolor{mygray}{rgb}{0.5,0.5,0.5}
\definecolor{mymauve}{rgb}{0.58,0,0.82}
\lstset{ backgroundcolor=\color{white}, basicstyle=\footnotesize, breaklines=true, captionpos=b, commentstyle=\color{mygreen}, escapeinside={\%*}{*)},keywordstyle=\color{blue}, stringstyle=\color{mymauve},}
\usepackage{caption}
\author{Olivier Lischer}
\date{\today}
\title{WrStat}
\hypersetup{
 pdfauthor={Olivier Lischer},
 pdftitle={WrStat},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7-pre)}, 
 pdflang={English}}
\begin{document}

\pagestyle{fancy}
\fancyhf{}
\fancyhead[R]{WrStat-HS23}
\fancyhead[L]{Exam Summary}
\fancyfoot[CE,CO]{\leftmark}
\fancyfoot[R]{\thepage}
\fancyfoot[L]{Olivier Lischer}

\begin{multicols}{2}
\section{Kombinatorik}
\label{sec:org55f22d5}
\subparagraph{Zählregel} \
\label{sec:orgf9185f6}
\begin{itemize}
\item Disjunkte Vereinigung: \(|A \cup B| = |A| + |B|\)
\item Vereinigung: \(|A \cup B| = |A| + |B| - |A \cap B|\)
\item Paare = Produkt: \(|A \times B| = |A| \cdot |B|\)
\end{itemize}
\subparagraph{Reihenfolge / Permutation} \
\label{sec:org19253b7}
Jeder Platz im Hörsaal wird belegt:
\begin{align*}
  P_n &= \underbrace{\#\text{\{Plätze für 1. Objekt\}}}_{n} \cdot \underbrace{\#\text{\{Plätze für 2. Objekte\}}}_{n-1} \cdot \ldots \cdot \underbrace{\#\{\text{Plätze für n. Objekte\}}}_{1} \\
  &= n \cdot (n-1) \cdot \ldots \cdot 1 = n!  \\
  &= \underbrace{\#\text{Plätze für 1. Objekt}}_{n} \cdot \underbrace{\#\text{Anordnung von n-1 Objekten}}_{P_{n-1}} \\
  &= n \cdot P_{n-1} = n \cdot (n - 1)! = n!
\end{align*}
\subparagraph{Anzahl / Auswahl Problem} \
\label{sec:orga2bb34b}
Auf wie viele Arten kann man \(k\) Plätze aus \(n\) Plätzen auswählen?
16 Studenten (\(k\)) platzieren sich auf 32 Plätzen (\(n\)).

\begin{align*}
\text{\#Auswahlprozesse} &= n \cdot (n - 1) \cdot \ldots \cdot (n - k + 1) \\
&= \frac{n!}{(n-k)!} \\
&= \binom{n}{k}
\end{align*}

Binominal Koeffizient (funktioniert meist nicht gut, Taschenrechner können grosse \(n!\) nicht rechnen)
Besser so:
\[
\frac{n \cdot (n - 1) \cdot (n - 2) \cdot \ldots \cdot (n-k + 1)}{1 \cdot 2 \cdot 3 \cdot \ldots \cdot k}
\]
\subparagraph{Variation} \
\label{sec:org2031f28}
Auch als Perlenkette bekannt
\[
\text{\#Möglichkeiten} = k[\text{Farben}]^{n[\text{Längen}]}
\]
\section{Ereignisse und Wahrscheinlichkeit}
\label{sec:org5bb73e0}
\subparagraph{Begriffe} \
\label{sec:org7568906}
\begin{center}
\begin{tabular}{ll}
Begriff & Model\\[0pt]
\hline
Versuchausgang, Elementarereignis & \(\omega\)\\[0pt]
alle Versuchsausgänge & \(\Omega\)\\[0pt]
Ereignis & \(A \subset \Omega\)\\[0pt]
Ereignis ist eingetreten & \(\omega \in A\)\\[0pt]
sicheres Ereignis, tritt immer ein & \(\Omega\)\\[0pt]
unmögliches Ereignis, kann nicht eintreten & \(\emptyset\)\\[0pt]
\(A\) und \(B\) tretten ein & \(A \cap B\)\\[0pt]
\(A\) oder \(B\) tretten ein & \(A \cup B\)\\[0pt]
\(A\) hat \(B\) zur Folge, wenn \(A\) dann auch \(B\) & \(A \subset B\)\\[0pt]
nicht A & \(\overline{A} = \Omega \setminus A\)\\[0pt]
\end{tabular}
\end{center}
\subparagraph{Bedingte Wahrscheinlichkeit} \
\label{sec:org6ca9db5}
Wahrscheinlichkeit, dass ein Toter ein rotes Shirt trägt (Wir untersuchen nur die Toten und schauen ob er ein Rotes Shirt trägt)
\[
P(R|T) = \frac{P(R \cap T)}{P(T)}
\]

\textbf{Satz von Bayes}:
\[
P(R|T) \cdot P(T) = P(R \cap T) = P(T|R) \cdot P(R)
\]

\textbf{Satz der totalen Wahrscheinlichkeit}
\begin{align*}
&P(T \cap G) &= P(T|G) \cdot P(G) \\
+&P(T \cap B) &= P(T|B) \cdot P(B) \\
+&P(T \cap R) &= P(T|R) \cdot P(R) \\
=&P(T)
\end{align*}
\section{Zufallsvariabeln}
\label{sec:org474bb27}
\subparagraph{Erwartungswert} \
\label{sec:org03fe57d}

\begin{equation}
\begin{split} \label{eqn:erwartungs-wert}
E(X) = \sum_{i=1}^{n}g_iP(A_i) \\
\end{split} 
\end{equation}
\subparagraph{Varianz} \
\label{sec:org8500b31}
\[
var(X) = E(X^2) - E(X)^2
\]
\section{Verteilungsfunktion und Wahrscheinlichkeitsdichte}
\label{sec:orgd83c9ac}
Die Verteilungsfunktion beschreibt die Wahrscheinlichkeiten der Werte einer Zufallsvariable:
\[
F(X) = P(X \le x)
\]

\(\phi(x)\) ist die Ableitung von \(F(x)\) und entspricht der Verteilungsdichte Funktion.
\[
\phi(x) = \frac{d}{dx}F(x) = F'(x)
\]

\begin{itemize}
\item Wahrscheinlichkeit: \(P(X = x) \rightarrow \phi(x) dx\)
\item Summe: \(\sum_x \rightarrow \int_\infty^\infty\)
\item \(E(X) = \sum_x x \cdot P(X = x) \rightarrow E(X) = \int_\infty^\infty x \cdot \phi(x) dx\)
\end{itemize}
Wichtig: Erkennen, was ist der Wert, was ist der Erwartungswert
\section{Exponential- / Erlang- / Poisson-Verteilung}
\label{sec:orga51bab2}
\subparagraph{Exponentialverteilung} \
\label{sec:orgeafa2f6}
\begin{description}
\item[{Dichtefunktion}] \(ae^{-ax}, a > 0\)
\item[{Verteilungsfunktion}] \(1 - e^{-ax}\)
\item[{Erwartungswert}] \(\frac{1}{a}\)
\item[{Varianz}] \(\frac{1}{a^2}\)
\item[{Median}] \(\frac{1}{a}\log{2}\)
\end{description}
\subparagraph{Possonverteilung} \
\label{sec:orgd0ac840}
\begin{description}
\item[{Wahrscheinlichkeit}] \(P_\lambda(k) = \frac{\lambda^k}{k!}e^{-\lambda}\)
\item[{Erwartungswert}] \(\lambda\)
\item[{Varianz}] \(\lambda\)
\end{description}
\section{Normalverteilung}
\label{sec:org0bfd1ee}
\subparagraph{Normalverteilung} \
\label{sec:org3a6df6f}
\begin{description}
\item[{Dichtefunktion}] \(\frac{1}{\sqrt{2\pi}\sigma}e^{-\frac{(x-\mu)^2}{2\sigma^2}}\)
\item[{Verteilungsfunktion}] keine elementare Funktion (Tabelle nutzen)
\item[{Erwartungswert}] \(\mu\)
\item[{Varianz}] \(\sigma\)
\item[{Median}] \(\mu\)
\end{description}
\section{Binominalverteilung}
\label{sec:orgffa80d8}
\subparagraph{Binominalverteilung} \
\label{sec:org93902f9}
\begin{description}
\item[{Wahrscheinlichkeit}] \(P(k) = \binom{n}{k}p^k(1-p)^{n-k}\)
\item[{Verteilungsfunktion}] \(F(k) = \sum_{i=0}^{k}\binom{n}{i}p^i(1-p)^{n-i}\)
\item[{Erwartungswert}] \(np\)
\item[{Varianz}] \(np(1-p)\)
\end{description}
\section{Schätzen}
\label{sec:org5f16fd4}
\subparagraph{Schätzen} \
\label{sec:orgf10b102}
Mittelwert ist häufig ein guter Schätzer
\subparagraph{t-Verteilung} \
\label{sec:orgea44cde}
t-Verteilung sollte dann verwendet werden, wenn man wenig Daten hat, aber es normall Verteilt ist (kleine \(n\)).
\section{Hypothesentest}
\label{sec:orgcceccc3}
\subparagraph{Vorgehen Hypothesentest} \
\label{sec:orgeabb25e}
\begin{enumerate}
\item Nullhypothese \(H_0\) und Alternativhypothese \(H_1\)
\item Testgrösse und Verteilung unter der Annahme der Nullhypothese
\item Wahl des Signifikanzniveaus \(\alpha\)
\item Kritischer Wert für Testgrösse, die nur mit Wahrscheinlichkeit \(\alpha\) erreicht wird
\item Kritischer Wert erreicht \(\Rightarrow\) Nullhypothese \(H_0\) verwerfen
\end{enumerate}
\subparagraph{t-Test} \
\label{sec:orgd3bcece}
Ist der neue Dünger besser?
Die Stichproben \(X_1, \ldots, X_n\) und \(Y_1, \ldots, Y_m\) mit gleicher Varianz haben den gleichen Erwartungswert.

\[
\overline{X} = \frac{X_1 + \cdots + X_n}{n}
\]

\[
S_X^2 = \frac{1}{n-1}\sum_{i=1}^n(X_i-\overline{X})^2
\]

\[
t = \frac{\overline{X} - \overline{Y}}{\sqrt{(n-1)S_X^2 + (m-1)S_Y^2}}\sqrt{\frac{nm(n+m-2)}{n+m}}
\]

\(t_{krit}\) kann aus der t-Verteilung abgelesen werden.
\(k\) erhält man durch \(n+m-2\).
Wenn \(t_{krit}\) überschritten wird, muss \(H_0\) verworfen werden.
\section{Test einer Verteilung}
\label{sec:org916f0de}
\subparagraph{X\textsuperscript{2}-Test} \
\label{sec:org6ae923c}

\[
D = \sum_{i=1}^d\frac{(n_i-np_i)^2}{np_i}
\]

D > D\_+ \(\Rightarrow\) Daten passen nicht (H\textsubscript{0} verwerfen)

D < D\_− \(\Rightarrow\) Daten passen zu gut, ist ein Hinweis auf Betrug
\subparagraph{Kolmogorov-Smirnov-Test} \
\label{sec:org7e87dd8}

\end{multicols}
\end{document}
